FemDesign.Loads.LineStressLoad
line_stress_load_type

FemDesign.Loads.LineStressLoad.Edge
Edge defining the geometry of the load

FemDesign.Loads.LineStressLoad.Direction
Direction of load.

FemDesign.Loads.LineStressLoad.Normal
Optional. Ambiguous what this does.

FemDesign.Loads.LineStressLoad._topBotLocVal
Top bottom field. Top value is normal force [kN], bottom value is moment [kNm], according to FD GUI.

FemDesign.Loads.LineStressLoad.TopBotLocVal
Top bottom property. Top bottom value can be a list of 1 or 2 items. 1 item defines a uniform line load, 2 items defines a variable line load.
Top bottom field. Top value is normal force [kN], bottom value is moment [kNm], according to FD GUI.

FemDesign.Loads.LineStressLoad.#ctor
Parameterless constructor for serialization

FemDesign.Loads.LineStressLoad.#ctor(FemDesign.Geometry.Edge,FemDesign.Geometry.Vector3d,System.Collections.Generic.List{FemDesign.Loads.TopBotLocationValue},FemDesign.Loads.LoadCase,System.String)
Construct a uniform or variable line stress load
edge: Underlying edge of line load. Line or Arc.
direction: Direction of load.
topBotLocVal: List of 2 top bottom location values